# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-seg instance segmentation model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/segment

# Ultralytics YOLOv8 UltraLite instance segmentation model
nc: 1 # number of classes (ubah sesuai kebutuhanmu)

# Scaling configuration: sangat ringan
depth_multiple: 0.25 # lebih rendah dari nano (0.33)
width_multiple: 0.125 # jauh lebih kecil dari nano (0.25)

backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 1-P2/4
  - [-1, 1, C2f, [64, True]] # 2
  - [-1, 1, Conv, [128, 3, 2]] # 3-P3/8
  - [-1, 1, C2f, [128, True]] # 4
  - [-1, 1, Conv, [256, 3, 2]] # 5-P4/16
  - [-1, 1, C2f, [256, True]] # 6
  - [-1, 1, Conv, [512, 3, 2]] # 7-P5/32
  - [-1, 1, C2f, [512, True]] # 8
  - [-1, 1, SPPF, [512, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C2f, [256]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, C2f, [128]] # 15

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, C2f, [256]] # 18

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, C2f, [512]] # 21

  - [[15, 18, 21], 1, Segment, [nc, 16, 128]] # smaller prototype resolution
